{
  "backend/main.mo": "Defines core backend types and logic for servers, rooms, posts, characters, and user profiles, including authorization checks and profile management APIs.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence data for tracking development progress.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend files for reference or documentation generation.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point that loads the React application root and main script.",
  "frontend/src/App.tsx": "Main React app component handling routing, auth state, profile gating, and layout wrapping.",
  "frontend/src/components/auth/CurrentUserBadge.tsx": "Displays the current user's avatar and name or a guest badge when unauthenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first-time users to create a profile with minimal fields.",
  "frontend/src/components/common/ErrorNotice.tsx": "Reusable destructive alert component for showing error messages.",
  "frontend/src/components/common/RequireAuthInline.tsx": "Inline auth gate that shows a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component handling navigation, header/footer, and routing via hash router.",
  "frontend/src/components/moderation/DeletePostButton.tsx": "Provides a confirmation dialog and mutation to delete a roleplay post.",
  "frontend/src/components/moderation/RemoveMemberButton.tsx": "Shows a confirmation dialog and triggers a mutation to remove a server member.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and invalidates queries when it changes.",
  "frontend/src/hooks/useCurrentUserPrincipal.ts": "Returns the current user's principal string from Internet Identity.",
  "frontend/src/hooks/useHashRouter.ts": "Implements a simple hash-based router with path and query param parsing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout methods, and persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on servers, rooms, posts, profiles, and membership.",
  "frontend/src/index.css": "Tailwind CSS setup defining custom color variables and dark mode styling.",
  "frontend/src/lib/serverRoles.ts": "Utility functions for checking user roles and permissions within a server.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers.",
  "frontend/src/pages/CharacterLibraryPage.tsx": "UI for listing, creating, and editing character profiles using dialogs and mutation hooks.",
  "frontend/src/pages/RoomViewPage.tsx": "Displays a room’s details and posts, with support for creating posts, refreshing, and moderation actions.",
  "frontend/src/pages/ServerDetailPage.tsx": "Shows server info, member status, and room list, allowing joining/leaving and room creation if permitted.",
  "frontend/src/pages/ServerDirectoryPage.tsx": "Lists all servers and provides a dialog to create new servers if the user is authenticated.",
  "frontend/src/pages/UserProfilePage.tsx": "Allows authenticated users to view and edit their profile details including name and bio.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, current state, and needed image assets."
}